.back-to-markdown/2011/01/colophon.org.markdown
Colophon
========

> Colophon \Col\"o/phon (k\[o\^\]l\"\[-o\]/f\[o\^\]n), n. \[L. colophon finishing stroke, Gr. kolofw\`n; cf. L. culmen top, collis hill. Cf. Holm.\]
>
> An inscription, monogram, or cipher, containing the place and date of publication, printer\'s name, etc., formerly placed on the last page of a book.

--- from [The Collaborative International Dictionary of English v.0.48](http://www.dict.org/bin/Dict?Form=Dict3&Database=gcide) via [dict.org](http://www.dict.org/bin/Dict?Form=Dict2&Database=*&Query=colophon)

Version 4 of my SWAAC blog
--------------------------

In my ever-increasing desire to remove extra steps from my life, and to hopefully increase my frequency of publishing posts on stuff I\'m learning (and I **am** learning, **all** the time), I\'ve decided to take a completely different turn, and convert the old [Jekyll](https://jekyllrb.com) based blog into one that is **only** posts, written in Emacs\' [org-mode](https://org-mode.org). I am writing more and more in org mode anyway, and it\'s now my standard mode for writing plain text files. So here we are.

I wrote a `Rakefile` to contain some common steps and make conversion and maintenance simpler.

Sure, it\'s not exactly pretty.

If you like the old one better, it\'s still at <https://github.com/tamouse/swaac-old-jekyll-site>. It\'s just not being updated.
